In [1]:
import pandas as pd

df = pd.read_csv('datasets/axisdata.csv')
df.head()

,Fname,Lname,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
0,Jada,Walters,F,39,N,3,2
1,Nicole,Henderson,F,46,N,3,6
2,Tanya,Moore,F,42,Y,4,6
3,Ronelle,Jackson,F,38,Y,5,3
4,Brad,Sears,M,33,N,4,2

In [2]:
df = pd.read_excel('datasets/axisdata.xlsx')
df.head()

,Fname,Lname,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
0,Jada,Walters,F,39,N,3,2
1,Nicole,Henderson,F,46,N,3,6
2,Tanya,Moore,F,42,Y,4,6
3,Ronelle,Jackson,F,38,Y,5,3
4,Brad,Sears,M,33,N,4,2

In [4]:
#Average Cars sold per month

int(df['Cars Sold'].sum())

3919

In [5]:
df.describe()

       Hours Worked  Years Experience   Cars Sold
count    999.000000        999.000000  999.000000
mean      33.727728          3.026026    3.922923
std        8.223454          1.394709    1.527000
min       20.000000          1.000000    1.000000
25%       27.000000          2.000000    3.000000
50%       34.000000          3.000000    4.000000
75%       41.000000          4.000000    5.000000
max       48.000000          5.000000    7.000000

In [6]:
# Max. Cars Sold
df['Cars Sold'].max()

7

In [7]:
# Min. Cars Sold
df['Cars Sold'].min()

1

In [8]:
# Average Cars sold by gender
df.groupby('Gender')['Cars Sold'].mean()

Gender
F    3.760736
M    4.078431
Name: Cars Sold, dtype: float64

In [9]:
#Average hours worked by people who sold >3 cars

df[df['Cars Sold'] >3]['Hours Worked'].mean()

34.740237691001695

In [10]:
# Average Years of experience

df['Years Experience'].mean()

3.026026026026026

In [11]:
# Average Years of experience for people who sold >3 cars

df[df['Cars Sold'] >3]['Years Experience'].mean()

3.0492359932088284

In [13]:
#Average Cars Sold by whether or not they had Sales Training
df.groupby('SalesTraining')['Cars Sold'].mean()

SalesTraining
N    3.573850
Y    4.168942
Name: Cars Sold, dtype: float64

In [14]:
df.corr()

                  Hours Worked  Years Experience  Cars Sold
Hours Worked          1.000000          0.028400   0.251038
Years Experience      0.028400          1.000000   0.062577
Cars Sold             0.251038          0.062577   1.000000

In [21]:
#Best Salesperson = One who sold most cars per hour
df['MonthlyHours'] = 30*(df['Hours Worked']/7)
df['SalesperHour'] = df['Cars Sold']/df['MonthlyHours']
maxsales = df['SalesperHour'].max()
df[df['SalesperHour'] ==maxsales]

,Fname,Lname,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold,MonthlyHours,SalesperHour
738,Peter,Walters,M,20,Y,5,6,85.714286,0.07